package days09;

/**
 * @author kenik
 * @date 2025. 2. 13. - 오후 5:28:21
 * @subject 
 * @content
 */
public class Ex04_07 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	} // main

}

/*
‘ㅇㅈ’는 출생등록지에 해당하는 지방자치단체의 고유 번호이다.
서울특별시 : 00~08
부산광역시 : 09~12
인천광역시 : 13~15
경기도 : 16~25
강원특별자치도 : 26~34
충청북도 : 35~39
대전광역시 : 40~41
충청남도 : 42~47
세종특별자치시 : 44, 96[10]
전북특별자치도 : 48~54
전라남도 : 55~66
광주광역시 : 55~56, 65~66
대구광역시 : 67~69, 76
경상북도 : 70~75, 77~81
경상남도 : 82~84, 86~89, 90~92
울산광역시 : 85, 90
제주특별자치도 : 93~95
 * */ 