package days02;

/**
 * @author kenik
 * @date 2025. 2. 4. - 오후 5:18:48
 * @subject 
 * @content
 */
public class Ex05_09 {

	public static void main(String[] args) {
		// [실수 표현]
		// 1) 실수 3.14 -> 2진수 표현  -> float [][][][][][][][][][] [][][][][][][][][][] [][][][][][][][][][] [][][][][][][][][][]
		// [예]
		/*           -> 2진수 표현(2진법 변환)
		 *   0.625   -> 0.101(2) 
		 *   0.625 x 2 = [1].25 ↓
		 *   0.25  x 2 = [0].5
		 *   0.5   x 2 = [1].0
		 *   
		 *   0.1     0       1(2) -> 10진수 실수 변환
		 *     2^-1+ 2^-2  + 2^-3
		 *   
		 *  [예] float/ double 오차 생긴다. 
		 *  0.123456 유한실수
		 *  0.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		 *  
		 *  내일 ~
		 *  [예] 9.123456 실수 -> 2진수 실수 변환 -> float(4)/double(8)
		 *    
		 * */

	} // main

} // class





